[
  {
    "text": "Customer requested a payment update"
  },
  {
    "text": "Customer requested a payment update"
  },
  {
    "text": "The customer wants to change their payment plan due to financial pressure"
  },
  {
    "text": "Context Cortex 2.0: The Realistic, Executable Plan The Pivot: From Infrastructure to Implementation Original Problem: Context Cortex 1.0 tried to be infrastructure (API layer). Infrastructure sales are slow, technical, and require enterprise credibility you don't have yet. New Approach: Be the done-for-you AI implementation service that uses context intelligence as your secret weapon. Business Name: Cortex Implementations One-Sentence Pitch: \"We implement AI agents that actually know your business—guaranteed working in 2 weeks or your money back—because we've solved the context problem everyone else ignores.\" Why This Version Works Better 1. Faster Sales Cycle Old: \"Buy our API and integrate it yourself\" (3-6 month sales cycle) New: \"We'll build you a working AI customer support agent in 2 weeks for €3k\" (1-2 week sales cycle) 2. Immediate Cash Flow Old: Monthly subscriptions that take months to build up New: €3k-€5k upfront implementation fees + €500/month maintenance 3. Prove Value First Old: They pay before seeing results New: They see a working solution in week 1, pay when satisfied 4. Lower Technical Barrier Old: Clients need technical teams to integrate your API New: You do everything, they just use itThe Specific Offer (Ultra-Focused) Target: B2B SaaS Companies with Zendesk (or similar) + 100+ support tickets/month What You Build For Them: \"The Context-Aware Support Agent\" A custom AI agent that: 1. Has read and understood their entire knowledge base, previous tickets, and product documentation 2. Can answer 60-70% of tier-1 support questions instantly 3. Routes complex issues to humans with full context 4. Gets smarter every week by learning from human responses Pricing Structure: Implementation: €3,500 (one-time, paid 50% upfront, 50% on delivery) Monthly Maintenance: €650/month (covers API costs, monitoring, weekly improvements) Money-Back Guarantee: If it doesn't handle 50+ tickets in the first month, full refund The €0-€10k Roadmap (Realistic Timeline) Month 1:"
  },
  {
    "text": "Gets smarter every week by learning from human responses Pricing Structure: Implementation: €3,500 (one-time, paid 50% upfront, 50% on delivery) Monthly Maintenance: €650/month (covers API costs, monitoring, weekly improvements) Money-Back Guarantee: If it doesn't handle 50+ tickets in the first month, full refund The €0-€10k Roadmap (Realistic Timeline) Month 1: Build Your First Client's Solution By Hand Investment: €0 (use free tiers) n8n: Self-hosted on free Render tier OpenAI: €200 credit (from their platform) Vector DB: Pinecone free tier (100k vectors) Action Steps: 1. Find ONE client through your network (ex-colleague, LinkedIn connection, friend's company) 2. Offer them the first build for €1,500 (50% off) to be your case study 3. Spend 2 weeks manually building their solution: Export their Zendesk data Process through OpenAI to create embeddings Build a simple Slack bot interface (easier than web) Test with their team for 1 weekIterate based on feedback Revenue: €1,500 (€750 upfront, €750 on completion) Time Investment: 40-60 hours (full-time for 2 weeks) Month 2-3: Perfect the Delivery, Get 2 More Clients Investment: €500 (paid from first client revenue) Proper hosting: €50/month OpenAI API: €200/month Basic landing page: €50 (Carrd) Action Steps: 1. Document every step of your first build 2. Create a reusable template/framework 3. Get video testimonial from first client 4. Use that testimonial to close 2 more clients at full price (€3,500) 5. Reduce implementation time to 1 week per client Revenue: €7,000 (implementation) + €650/month recurring (from first client) Running Total: €8,500 one-time + €650/month Month 4-6: Systematize and Scale to 5 Active Clients Investment: €1,000 (paid from revenue) Hire VA for data collection/prep: €300/month Better tools and automation: €200/month Action Steps: 1. Build standardized intake process (Google Form + Calendly) 2. Create \"implementation in a box\" (templates, scripts, documentation) 3. Close 3 more clients (now at"
  },
  {
    "text": "Systematize and Scale to 5 Active Clients Investment: €1,000 (paid from revenue) Hire VA for data collection/prep: €300/month Better tools and automation: €200/month Action Steps: 1. Build standardized intake process (Google Form + Calendly) 2. Create \"implementation in a box\" (templates, scripts, documentation) 3. Close 3 more clients (now at 5 total active) 4. Implementation time down to 3-4 days per client 5. Start outbound: LinkedIn outreach to SaaS founders (30 messages/day)Revenue: 3 new implementations: €10,500 5 recurring clients: €3,250/month Monthly Recurring: €3,250 Month 7-9: Hit €10k/Month Milestone Action Steps: 1. Focus on retention (keep all 5 clients happy) 2. Add 5 more implementation clients 3. Introduce annual option: €6,500/year (save €1,300) - gets cash flow 4. Hire part-time closer to handle demos: €500/month Revenue: 5 new implementations: €17,500 10 recurring clients: €6,500/month 2 clients convert to annual: €13,000 upfront Monthly Recurring: €6,500 + implementation pipeline Month 10-12: Scale to €15k-€20k/Month Action Steps: 1. Maintain 12-15 active monthly clients 2. Do 2-3 implementations per month (€10,500/month) 3. Launch \"self-serve\" tier at €1,500 implementation + €350/month (for smaller companies) 4. Build referral program: €500 for every qualified referral Monthly Recurring: €10,000-€12,000 Implementation Revenue: €7,000-€10,500/month Total: €17k-€22k/month Why This Timeline Is Realistic 1. You're selling outcomes, not technology - easier to sell2. Fast feedback loops - you see what works in weeks, not months 3. Upfront cash - implementation fees fund operations immediately 4. Compounding recurring - each client adds €650/month forever 5. Standardization happens naturally - you'll build templates by necessity The Automation Evolution Phase 1 (Month 1-3): Manual Everything You personally build each solution Learn what clients actually need Discover edge cases Phase 2 (Month 4-6): Template + VA 70% templated, 30% custom VA handles data prep You do implementation + QA Phase 3 (Month 7-12): Semi-Automated 90% templated VA"
  },
  {
    "text": "The Automation Evolution Phase 1 (Month 1-3): Manual Everything You personally build each solution Learn what clients actually need Discover edge cases Phase 2 (Month 4-6): Template + VA 70% templated, 30% custom VA handles data prep You do implementation + QA Phase 3 (Month 7-12): Semi-Automated 90% templated VA does full implementation following your playbook You do sales + QA only Work 10-15 hours/week Critical Success Factors 1. Niche Discipline Stick to B2B SaaS with Zendesk until you have 10 clients. Don't chase every opportunity. 2. Money-Back Guarantee This eliminates the biggest objection. You can afford it because you'll nail the delivery. 3. Weekly Improvement Calls Schedule 15-min calls with each client weekly for first month. This ensures retention and generates testimonials.4. Case Studies Over Marketing Every client must give you: Video testimonial Metrics (tickets handled, time saved) Permission to use their logo These sell better than any ads. Projected Monthly Income Month Implementation Revenue Recurring Revenue Total 1 €1,500 €0 €1,500 2 €3,500 €650 €4,150 3 €3,500 €1,300 €4,800 4 €3,500 €1,950 €5,450 5 €3,500 €2,600 €6,100 6 €3,500 €3,250 €6,750 7 €7,000 €3,900 €10,900 8 €7,000 €5,200 €12,200 9 €7,000 €6,500 €13,500 10 €8,500 €7,800 €16,300 11 €8,500 €9,100 €17,600 12 €10,500 €10,400 €20,900   The Real Competitive Advantage You're not selling \"context intelligence\" (nobody knows what that means). You're selling: \"AI that actually works because it knows YOUR business.\" Every competitor is selling generic ChatGPT wrappers. You're selling custom intelligence. That's the difference between a commodity and a premium service. Next Steps (Start Tomorrow) 1. Today: Write down 20 people you know who work at B2B SaaS companies2. Tomorrow: Message 5 of them asking if they'd be interested in a case study (free/discounted AI implementation) 3. This Week: Close 1 client and start building 4."
  },
  {
    "text": "commodity and a premium service. Next Steps (Start Tomorrow) 1. Today: Write down 20 people you know who work at B2B SaaS companies2. Tomorrow: Message 5 of them asking if they'd be interested in a case study (free/discounted AI implementation) 3. This Week: Close 1 client and start building 4. This Month: Deliver and get testimonial Don't wait. Don't perfect the pitch. Just start building for one real client. The business will reveal itself through doing."
  },
  {
    "text": "Title: \"Enhanced Energy Expenditure and Activity Type Prediction Through Multi-Sensor Data Integration and Advanced Neural Network Modeling\" Abstract: The paper introduces a novel approach to Physical Activity Monitoring (PAM) by integrating multi-sensor data from wearables and environmental factors with advanced deep learning models. This study aims to overcome the limitations of traditional machine learning models in classifying similar physical activities and estimating energy expenditure, by leveraging big data and neural network modeling, particularly focusing on Long Short-Term Memory (LSTM) networks. Introduction: Why? Existing PAM systems show limitations in distinguishing activities with similar movement patterns and accurately estimating energy expenditure. This research aims to address these challenges by applying an integrated approach that combines data from multiple sources and utilizes the capabilities of advanced neural networks. Research and Technical Objectives: Develop a deep learning model that integrates multi-sensor wearable data and environmental factors to improve the accuracy of physical activity classification. Compare the performance of the proposed model against traditional machine learning models in terms of accuracy and computational efficiency. Assess the impact of including environmental data on the prediction accuracy of different physical activities and energy expenditures. Evaluate the real-time processing capabilities of the proposed model for potential deployment in wearable devices. Investigate the model's adaptability and personalization potential across different user demographics. Correct Sampling Strategy: The study will recruit a diverse population exceeding the initial 9 subjects to ensure variety in age, health status, and physical activity patterns. A stratified sampling method will be used to ensure representativeness across different groups, enhancing the model's generalization capability. Domain and Problem Area of Focus: The research focuses on the domain of health and fitness, specifically improving the accuracy and reliability of Physical Activity Monitoring systems through deep learning and big data integration. Adding Value to the Area of Research Already Done:"
  },
  {
    "text": "different groups, enhancing the model's generalization capability. Domain and Problem Area of Focus: The research focuses on the domain of health and fitness, specifically improving the accuracy and reliability of Physical Activity Monitoring systems through deep learning and big data integration. Adding Value to the Area of Research Already Done: This study intends to extend the existing body of PAM research by introducing an advanced model that can handle complex data patterns and provide more precise activity recognition and energy expenditure estimates. By incorporating environmental factors, the research adds a new dimension to activity monitoring, providing insights into how external conditions affect physical activities. Understanding & Managing Bias: To mitigate bias, the study will use diverse datasets and validate the model across different populations. Techniques like cross-validation, regularization, and ensemble methods will be employed to reduce overfitting and ensure the model's robustness and fairness. Researching Vulnerable Groups: The study will include vulnerable groups such as the elderly or individuals with chronic conditions to ensure the model's effectiveness and adaptability across different health statuses. Ethics in Data Analytics: The research will adhere to ethical standards by obtaining informed consent from all participants, anonymizing personal data, and ensuring the privacy and security of collected data. The study will also transparently address any potential ethical issues arising from data collection, analysis, and model deployment. Methodology: Detailed steps covering data collection, preprocessing, model development, and evaluation, following the guidelines and objectives outlined. Results and Discussion: Analysis of the model's performance compared to existing solutions, discussion of the findings, and their implications for PAM systems. Conclusion and Future Work: Summarize the contributions of the research and propose directions for future studies, particularly focusing on further personalization and adaptation of the model to different environmental contexts and user needs. By following this structure, the research aims"
  },
  {
    "text": "discussion of the findings, and their implications for PAM systems. Conclusion and Future Work: Summarize the contributions of the research and propose directions for future studies, particularly focusing on further personalization and adaptation of the model to different environmental contexts and user needs. By following this structure, the research aims to provide a significant contribution to the field of Physical Activity Monitoring, addressing existing gaps and introducing innovative solutions through the use of advanced neural network architectures and big data analytics."
  },
  {
    "text": "class TradeDoc: def __init__(self, name, email,_addr1,_addr2,_addr3,_number,_date, _product_name,_cost): self.customer_name = \"john cole\" self.customer_addr1 = \"2 main street\" self.customer_addr2 = \"west city\" self.customer_addr3 = \"west\" self.customer_number = \"088839022\" self.customer_date = \"09/05/2019\" self.customer_product_name = \"box\" self.customer_cost = \"332\" self.customer_email = \"gsdu@kvsddc\" # End Init # End Class class SalesOrder(TradeDoc): Order_Number = 0 Email_address = \"sales@comp.com\" VAT_Number = 999 def check_email(self, email): print(\"the order will send our\") \"Checking '{}' is valid Mailing address\".format(email,self.email) #end Subclass class Dispach_Note(TradeDoc): dISPA = 0 Email = \"blurb\" VAT = 22 VatRate = 4234 TransNum = 4 Total_Cost = 232 def Cal_Cost (self, Total_Cost, Product_cost): print(\"Total Cost is\", VatRate*Product_cost) #End #End SubClass Sales_Invoice(TradeDoc) Invoice_number = 80 VAT_rate = 1.3 Transport_number= 4934892 Total_cost = 300 def Cal_Cost (self, Total_Cost, Product_cost): print(\"Total Cost is\", VatRate*Product_cost) #End #End SubClass class Send_Invoice(TradeDoc): def name(self, name): print(\"The order will send our \"\" '{}' an invoice '{}'\".format (name,self.customer_name) t1 = TradeDoc(\"\",\"\",\"\",\"\",\"\",\"\",\"\",\"\",\"\") s1 = SalesOrder(\"\",\"\",\"\",\"\",\"\",\"\",\"\",\"\",\"\") print (t1) print(s1) Send_invoice(): print(\"Sending {} an invoice\", self.customer_name) # End Init"
  },
  {
    "text": "jupyter==1.0.0 lxml==4.5.1 MarkupSafe==1.1.1 matplotlib==3.3.2 notebook==6.0.3 numpy==1.18.1 openpyxl==3.0.4 pandas==1.1.2 Pillow==7.2.0 scikit-learn==0.23.2 scipy==1.4.1 seaborn==0.11.0 SQLAlchemy==1.3.18"
  },
  {
    "text": "Title: \"Enhanced Energy Expenditure and Activity Type Prediction Through Multi-Sensor Data Integration and Advanced Neural Network Modeling\" Abstract: The paper introduces a novel approach to Physical Activity Monitoring (PAM) by integrating multi-sensor data from wearables and environmental factors with advanced deep learning models. This study aims to overcome the limitations of traditional machine learning models in classifying similar physical activities and estimating energy expenditure, by leveraging big data and neural network modeling, particularly focusing on Long Short-Term Memory (LSTM) networks. Introduction: Why? Existing PAM systems show limitations in distinguishing activities with similar movement patterns and accurately estimating energy expenditure. This research aims to address these challenges by applying an integrated approach that combines data from multiple sources and utilizes the capabilities of advanced neural networks. Research and Technical Objectives: Develop a deep learning model that integrates multi-sensor wearable data and environmental factors to improve the accuracy of physical activity classification. Compare the performance of the proposed model against traditional machine learning models in terms of accuracy and computational efficiency. Assess the impact of including environmental data on the prediction accuracy of different physical activities and energy expenditures. Evaluate the real-time processing capabilities of the proposed model for potential deployment in wearable devices. Investigate the model's adaptability and personalization potential across different user demographics. Correct Sampling Strategy: The study will recruit a diverse population exceeding the initial 9 subjects to ensure variety in age, health status, and physical activity patterns. A stratified sampling method will be used to ensure representativeness across different groups, enhancing the model's generalization capability. Domain and Problem Area of Focus: The research focuses on the domain of health and fitness, specifically improving the accuracy and reliability of Physical Activity Monitoring systems through deep learning and big data integration. Adding Value to the Area of Research Already Done:"
  },
  {
    "text": "different groups, enhancing the model's generalization capability. Domain and Problem Area of Focus: The research focuses on the domain of health and fitness, specifically improving the accuracy and reliability of Physical Activity Monitoring systems through deep learning and big data integration. Adding Value to the Area of Research Already Done: This study intends to extend the existing body of PAM research by introducing an advanced model that can handle complex data patterns and provide more precise activity recognition and energy expenditure estimates. By incorporating environmental factors, the research adds a new dimension to activity monitoring, providing insights into how external conditions affect physical activities. Understanding & Managing Bias: To mitigate bias, the study will use diverse datasets and validate the model across different populations. Techniques like cross-validation, regularization, and ensemble methods will be employed to reduce overfitting and ensure the model's robustness and fairness. Researching Vulnerable Groups: The study will include vulnerable groups such as the elderly or individuals with chronic conditions to ensure the model's effectiveness and adaptability across different health statuses. Ethics in Data Analytics: The research will adhere to ethical standards by obtaining informed consent from all participants, anonymizing personal data, and ensuring the privacy and security of collected data. The study will also transparently address any potential ethical issues arising from data collection, analysis, and model deployment. Methodology: Detailed steps covering data collection, preprocessing, model development, and evaluation, following the guidelines and objectives outlined. Results and Discussion: Analysis of the model's performance compared to existing solutions, discussion of the findings, and their implications for PAM systems. Conclusion and Future Work: Summarize the contributions of the research and propose directions for future studies, particularly focusing on further personalization and adaptation of the model to different environmental contexts and user needs. By following this structure, the research aims"
  },
  {
    "text": "discussion of the findings, and their implications for PAM systems. Conclusion and Future Work: Summarize the contributions of the research and propose directions for future studies, particularly focusing on further personalization and adaptation of the model to different environmental contexts and user needs. By following this structure, the research aims to provide a significant contribution to the field of Physical Activity Monitoring, addressing existing gaps and introducing innovative solutions through the use of advanced neural network architectures and big data analytics."
  },
  {
    "text": "Title: \"Enhanced Energy Expenditure and Activity Type Prediction Through Multi-Sensor Data Integration and Advanced Neural Network Modeling\" Abstract: The paper introduces a novel approach to Physical Activity Monitoring (PAM) by integrating multi-sensor data from wearables and environmental factors with advanced deep learning models. This study aims to overcome the limitations of traditional machine learning models in classifying similar physical activities and estimating energy expenditure, by leveraging big data and neural network modeling, particularly focusing on Long Short-Term Memory (LSTM) networks. Introduction: Why? Existing PAM systems show limitations in distinguishing activities with similar movement patterns and accurately estimating energy expenditure. This research aims to address these challenges by applying an integrated approach that combines data from multiple sources and utilizes the capabilities of advanced neural networks. Research and Technical Objectives: Develop a deep learning model that integrates multi-sensor wearable data and environmental factors to improve the accuracy of physical activity classification. Compare the performance of the proposed model against traditional machine learning models in terms of accuracy and computational efficiency. Assess the impact of including environmental data on the prediction accuracy of different physical activities and energy expenditures. Evaluate the real-time processing capabilities of the proposed model for potential deployment in wearable devices. Investigate the model's adaptability and personalization potential across different user demographics. Correct Sampling Strategy: The study will recruit a diverse population exceeding the initial 9 subjects to ensure variety in age, health status, and physical activity patterns. A stratified sampling method will be used to ensure representativeness across different groups, enhancing the model's generalization capability. Domain and Problem Area of Focus: The research focuses on the domain of health and fitness, specifically improving the accuracy and reliability of Physical Activity Monitoring systems through deep learning and big data integration. Adding Value to the Area of Research Already Done:"
  },
  {
    "text": "different groups, enhancing the model's generalization capability. Domain and Problem Area of Focus: The research focuses on the domain of health and fitness, specifically improving the accuracy and reliability of Physical Activity Monitoring systems through deep learning and big data integration. Adding Value to the Area of Research Already Done: This study intends to extend the existing body of PAM research by introducing an advanced model that can handle complex data patterns and provide more precise activity recognition and energy expenditure estimates. By incorporating environmental factors, the research adds a new dimension to activity monitoring, providing insights into how external conditions affect physical activities. Understanding & Managing Bias: To mitigate bias, the study will use diverse datasets and validate the model across different populations. Techniques like cross-validation, regularization, and ensemble methods will be employed to reduce overfitting and ensure the model's robustness and fairness. Researching Vulnerable Groups: The study will include vulnerable groups such as the elderly or individuals with chronic conditions to ensure the model's effectiveness and adaptability across different health statuses. Ethics in Data Analytics: The research will adhere to ethical standards by obtaining informed consent from all participants, anonymizing personal data, and ensuring the privacy and security of collected data. The study will also transparently address any potential ethical issues arising from data collection, analysis, and model deployment. Methodology: Detailed steps covering data collection, preprocessing, model development, and evaluation, following the guidelines and objectives outlined. Results and Discussion: Analysis of the model's performance compared to existing solutions, discussion of the findings, and their implications for PAM systems. Conclusion and Future Work: Summarize the contributions of the research and propose directions for future studies, particularly focusing on further personalization and adaptation of the model to different environmental contexts and user needs. By following this structure, the research aims"
  },
  {
    "text": "discussion of the findings, and their implications for PAM systems. Conclusion and Future Work: Summarize the contributions of the research and propose directions for future studies, particularly focusing on further personalization and adaptation of the model to different environmental contexts and user needs. By following this structure, the research aims to provide a significant contribution to the field of Physical Activity Monitoring, addressing existing gaps and introducing innovative solutions through the use of advanced neural network architectures and big data analytics."
  },
  {
    "text": "puting 1/12 Before setting the scene it is instructive to look at the historical evolution of computing through an epoch view Internet era (1995-present) 2/12 Does it have to have all those business innovation features to When is a service not in the cloud? Actually, there are very specific characteristics of cloud computing 3/12 Even though there is a concept called a private cloud (more later) we will confine ourselves mostly to the idea that cloud is a public, out-sourced service In practice, this is a continuum ranging from fully on premises to 4/12 technological innovations to offer out-sourced computing services an elastically-provisionable compute, storage and networking fabric Re-sell complete software applications (as services) such as 5/12 • Per-usage tariffs on the infrastructure or platforms • Non-intermediated, automated self-provisioning over the • Leveraging existing e-commerce web-based transactions • Homogenised packaging, pricing and delivery of services • • • • 6/12 • Don’t pay for what you are not using • • Total cost of ownership included • Consumer-style billing for (almost) everyone • • • • 7/12 because of cloud computing is enabling Businesses can make relatively low-risk bets to test market interest before committing significant spending Strategic investment inflection points more visible 8/12 • • Leading to de facto standards by virtue of commercial success No real contracts or guarantees exist • • Withdrawl of services • • Weak international regulation environment • Dominance by a small number of monopolistic providers 9/12 Somewhat of a generic outsourcing consideration, but what position? through a lack of skills, motivation or resources 10/12 rarely that simple Existing and new staff may require different kinds of training of key staff Each consideration may tempt managers to postpone 11/12 Customer attitudes towards their data Competitors’ stance and relative adoption of cloud technology 12/12 1/10"
  },
  {
    "text": "what position? through a lack of skills, motivation or resources 10/12 rarely that simple Existing and new staff may require different kinds of training of key staff Each consideration may tempt managers to postpone 11/12 Customer attitudes towards their data Competitors’ stance and relative adoption of cloud technology 12/12 1/10 Cloud computing is a well-established computing model, becoming computing and to be able to differentiate it clearly from traditional on-premises computing, we adopt the National Institute for • • • Service models 2/10 without requiring human interaction with each service provider. 3/10 consumers using a multi-tenant model, with different physical and virtual resources dynamically assigned and re-assigned according to datacenter). Examples of resources include storage, processing, 4/10 NIST Essential Characteristics 4. Rapid elasticity Capabilities can be elastically provisioned and released, in some cases automatically, to scale rapidly outward and inward commensurate with demand. To the consumer, the capabilities available for provisioning often appear to be unlimited and can be appropriated in any quantity at any time. 5. Measured service Cloud systems automatically control and optimize resource use by leveraging a metering capability at some level of abstraction appropriate to the type of service (e.g., storage, processing, 5/10 bandwidth, and active user accounts). Resource usage can be monitored, controlled, and reported, providing transparency for both the provider and consumer of the utilized service. 6/10 The capability provided to the consumer is to provision processing, infrastructure but has control over operating systems, storage, and networking components (e.g., host firewalls). 7/10 The capability provided to the consumer is to deploy onto the cloud infrastructure consumer-created or acquired applications created using programming languages, libraries, services, and tools control the underlying cloud infrastructure including network, deployed applications and possibly configuration settings for the 8/10 The capability provided to the consumer is to use the provider’s"
  },
  {
    "text": "provided to the consumer is to deploy onto the cloud infrastructure consumer-created or acquired applications created using programming languages, libraries, services, and tools control the underlying cloud infrastructure including network, deployed applications and possibly configuration settings for the 8/10 The capability provided to the consumer is to use the provider’s the underlying cloud infrastructure including network, servers, operating systems, storage, or even individual application capabilities, with the possible exception of limited user-specific 9/10 NIST Deployment Models Private cloud The cloud infrastructure is provisioned for exclusive use by a single organization comprising multiple consumers (e.g., business units). It may be owned, managed, and operated by the organization, a third party, or some combination of them, and it may exist on or off premises. Community cloud The cloud infrastructure is provisioned for exclusive use by a specific community of consumers from organizations that have shared concerns (e.g., mission, security requirements, policy, and 10/10 compliance considerations). It may be owned, managed, and operated by one or more of the organizations in the community, a third party, or some combination of them, and it may exist on or off premises. 11/10 The cloud infrastructure is a composition of two or more distinct proprietary technology that enables data and application portability e.g., cloud bursting for load balancing between clouds 12/10 1/26 • One of the three service models defined by NIST • infrastructure but has control over operating systems, storage, and deployed applications; and possibly limited control of select networking components (e.g., host firewalls). 2/26 • • Mostly direct substitute for • A pool of compute, storage • • 3/26 4/26 5/26 6/26 capacity or any wastage of unused capacity set up and maintained by the cloud provider, saving the time and 7/26 The service can usually be accessed from any location as long as"
  },
  {
    "text": "• • Mostly direct substitute for • A pool of compute, storage • • 3/26 4/26 5/26 6/26 capacity or any wastage of unused capacity set up and maintained by the cloud provider, saving the time and 7/26 The service can usually be accessed from any location as long as cloud allows it Services available through a public cloud, or private clouds hosted externally with the cloud provider, benefit from the physical 8/26 • • • Only pay for what you use IaaS providers’ scale enab les them to recruit top talent (and the 9/26 First Generation Services IaaS were among the first generation of cloud services to roll out. • IaaS is the closest mapping to on-premises model so the adoption conversation was familiar and marketing the value proposition was easier • Cloud vendors were testing the market to see what it could bear, before commiting more investment to larger-scale or more complex offerings • Migration for early adopters is simplified - software stacks can be moved unchanged to the cloud infrastructure • Cloud adopters could hedge between on-premise and the Cloud before committing 10/26 • The early cloud was more primitive, lacking any of now- ubiquitous platform-as-a-service offerings that we see today 11/26 • • infrastructure itself, including physical placement, power, air • But the customer is responsible for managing operating redundancy concerns and application security 12/26 • With few exceptions, most users will run their IaaS workloads • statistical multiplexing of different user workloads on the same • This is the central proposition underlying on-demand and • characteristics so this might only be considered a 13/26 • • users must plan for potential significant outages • • Cloud vendors offer customers the option of placing their IaaS resilience into the stack 14/26 • A region is a"
  },
  {
    "text": "• This is the central proposition underlying on-demand and • characteristics so this might only be considered a 13/26 • • users must plan for potential significant outages • • Cloud vendors offer customers the option of placing their IaaS resilience into the stack 14/26 • A region is a fully independent, fully serviced, fully • Typically these are located in different continents, countries or • Location a service in multiple regions offers: • Extra resilience as the chances concurrent service outages in • The ability to locate services closer to cloud service consumers • may pertain to data privacy, data protection, disclosure 15/26 • data-center within a single region • These are typically located in different cities in the same • A Cloud customer looking to provide more than the standard 99.9 • Of one AZ becomes partitioned, the the other one will likely • Using AZs to increase service resilience is usually cheaper than spreading over regions as inter-AZ network traffic is usually 16/26 These fall broadly into compute, storage and networking • nodes are just virtualised, multi-tenant or metal application workloads • in this model is usually mountable block storage • 17/26 • One the oldest and easily the largest by volume Cloud • • • • Per-second billing with a choice of on-demand pricing, • 18/26 • • • Storage is durable across VM reboots • 19/26 • Clusters must have at least one but can have many more • • • • • • models when migrat ing to or architecting anew for the Cloud 20/26 • Relatively small number of system specifications and sizes • • • • • Customers select by matching to the best-guess estimate or • Designed to be scaled out and in as demand dictates 21/26 • Based on size"
  },
  {
    "text": "when migrat ing to or architecting anew for the Cloud 20/26 • Relatively small number of system specifications and sizes • • • • • Customers select by matching to the best-guess estimate or • Designed to be scaled out and in as demand dictates 21/26 • Based on size and duration of usage • • Cost is easy to predict for stable workloads • • 22/26 • • Monitoring assists customers to: • Make the right choices of compute and storage specifications • Manage the costs of running their IaaS services • • Set triggers and alerts for over-spends or unusual activity • etc • 23/26 collection Worked Example: Self-hosted RDBMS on AWS • Let’s look at a concrete example of using the case-study AWS services to stand up a self-hosted database instance (e.g. Oracle) • Databases are memory-intensive and somewhat CPU-intensive so you would choose an EC2 instance that offered the right balance between these while also considering the pricing • Multiple compute nodes might be chosen to allow to run in failover mode • Databases are quite IO-intensive so high-performing EBS volume(s) would be attached to the compute nodes 24/26 • The VPC would be configured to host the compute/storage in secure way, only allowing the necessary access to the RDBMS consumers 25/26 • When the application stack cannot be easily decomposed and • • be possible with an IaaS approach 26/26 • complexity and risk to a higher order services in the PaaS tier • • redundant services is significantly higher than doing so on 27/26 • Cloud IaaS is the closest analogue to the on-premise model • Service types mirror the commonly-understood computing abstractions of compute, storage and networking • Services can be allocated rapidly, elastically and on-demand • The Cloud vendors manage the infrastructure"
  },
  {
    "text": "redundant services is significantly higher than doing so on 27/26 • Cloud IaaS is the closest analogue to the on-premise model • Service types mirror the commonly-understood computing abstractions of compute, storage and networking • Services can be allocated rapidly, elastically and on-demand • The Cloud vendors manage the infrastructure and the • • Monitoring is available to manage scalability parameters, • IaaS is a good-fit model for on-premise migration and 28/26 1/12 • included that cloud computing was self-service and connected • • Provision cloud resources, i.e. create/destroy on demand • Manage attributes of provisioned services, e.g. size, performance, cost, acces, etc • • These fall broadly into four categories being suitable for • Graphical user int erfaces (web, mobile) • • 2/12 • • • • Acts as the billable entity for consumed services • Is assigned various privileges to carry out tasks on the Cloud Most Cloud platforms support hierarchical access management 3/12 • • • • • Manage policies • • • • Manage service monitoring • • 4/12 • • • Full set of management • • • • • Exploring vendor new 5/12 • • • Can be clunky to get complex things done (many screens and 6/12 • • Stable, versioned • • Full management features • scriptable • • Integratable into other tools • 7/12 • • • Relatively stable, with regular update releases • • Also authenticated, encrypted access • Full management features • • • Integratable with other tools • Easier to learn 8/12 • Automation of service management • • • Or user-defined scripts • • • • • • 9/12 • legacy automation tasks from the on-premisies model, partularly for IaaS deployments. • application software is still the customer’s responsibility. • • • • 10/12 • In brief:"
  },
  {
    "text": "Easier to learn 8/12 • Automation of service management • • • Or user-defined scripts • • • • • • 9/12 • legacy automation tasks from the on-premisies model, partularly for IaaS deployments. • application software is still the customer’s responsibility. • • • • 10/12 • In brief: Development practices and philosophy with the • • Build the automated process that delivers the plan • • • Deploy to production • • 11/12 12/12 1/21 • • Stable, versioned • • Full management features • scriptable • • Integratable into other tools • 2/21 • • • • • You can think of resources as database tables like customers, • 3/21 • • • • 4/21 Resources fall broadly into two basic types • Items and collections have slightly different semantics in a • or synthetic group of attributes, usually represented as key/value attributes of a server) 5/21 6/21 A Note on Idempotence • Idempotence is the property of an operation such that the operation can be applied multiple times to some value without changing the outcome beyond its first application • In the context of REST, we can say that some operations are idempotent if, after the first application of an operation on a resource (which may alter service state), subsequent applications of that operation don’t alter the service state, no matter how many times that operation is later applied • Consideration of idempotence is important in the context of a message passing API over a latent, unreliable network as clients 7/21 need guaranteed API semantics in the face of potential network partitions 8/21 Resource Operation Remove 9/21 • • • For example, updating a customer record’s name 10/21 • • This assumes the a priori existence of the collection itself • • 11/21 • In this"
  },
  {
    "text": "unreliable network as clients 7/21 need guaranteed API semantics in the face of potential network partitions 8/21 Resource Operation Remove 9/21 • • • For example, updating a customer record’s name 10/21 • • This assumes the a priori existence of the collection itself • • 11/21 • In this example, the customers collection, the customer item and the notices association collection already exist • collection having the specified attributes • By convention the return code is 201 (created) and a 12/21 • • • last-read timestamp attributes associated with resources • 13/21 14/21 • ways, either fully or partially • is considered to be an idempotent operation as multiple PUTs with the same values don’t alter the state following the first • resource but this is not considered to be automatically idempotent because of the way an API might do the updates • An update which replaces an attribute in place would be idempotent but an operation to add to a list, for example, 15/21 • specified attributes • The updated resource retains its previously-assigned identifier following the full update • 16/21 • specified attributes • • • 17/21 • • • • 18/21 • specified attributes • reused (good practice) • 19/21 • • • • 20/21 REST API Implementations • A REST API can be implemented on the server-side using any language or framework that supports HTTP (E.g. Python and Flask) • A commonly used pattern for implementing REST server middleware is the Model View Controller (MVC) pattern • Model: Abstraction of the data resources being managed by the server (e.g. customers) and includes the associated database interactions • View: Wire representation of the client-server messages (e.g. JSON, XML) 21/21 • Controller: The HTTP endpoint logic that processes the clients HTTP requests - one handler for each"
  },
  {
    "text": "pattern • Model: Abstraction of the data resources being managed by the server (e.g. customers) and includes the associated database interactions • View: Wire representation of the client-server messages (e.g. JSON, XML) 21/21 • Controller: The HTTP endpoint logic that processes the clients HTTP requests - one handler for each URI type (e.g. POST /customers/23764823/notices) • In practice, there are also many other tiers involved such as load-balancers and caches which sit in front of the REST middleware 22/21 • • • Cloud resources are modeled as addressable endpoints (URIs) • bindings are built • Likely to be replaced by competing technologies in the coming 23/21 March 05, 2020 1/16 Virtualisation • Virtualisation is a key concept and driver in the delivery of cloud services and operates in each of the service models. • Virtualization is the key technology enabler for Cloud from a technical and economic perspective • The term has become synonymous with hardware virtualisation, namely the provisioning of virtual machines running over bare metal, but it has a much wider meaning • Virtualisation essentially means the presentation of some abstracted, operationally simplified view of some physical or logical computing, storage or networking resources • 2/16 Virtualised resources are the principal building blocks of software, networking and ultimately cloud computing Illustrative Examples • The Transport Control Protocol (TCP/IP) (ISO L4) provides a virtualized view of an underlying datagram network using sessions, windowing, ordering and reliable delivery • A filesystem is a virtualized view of a block storage device presenting concepts such as folders, files, ordering and random access • A CPU emulator is a virtualized view of a computer system allowing the hosting of one architecture on another (e.g. an 3/16 ARM mobile phone emulator) running on an x86/AMD64 architecture • An operating system is a virtualized view"
  },
  {
    "text": "presenting concepts such as folders, files, ordering and random access • A CPU emulator is a virtualized view of a computer system allowing the hosting of one architecture on another (e.g. an 3/16 ARM mobile phone emulator) running on an x86/AMD64 architecture • An operating system is a virtualized view of a system’s resources allowing CPU, memory and attached hardware to be concurrently accessed, managed and shared between tasks 4/16 Increase operational simplicity and utility by hiding systems Reduce physical footprint through higher density Increased reliability through simplicity of management and Reduce 5/16 6/16 Highly redundant data stores implemented on replicated and distributed file systems 7/16 8/16 Most physical servers only use 5-15% of their capabilities on average, while consuming 60-90% of their peak power. Reduce 9/16 VMs run independent instances of an operating system The number of virtual CPUs presented may differ from the actual physical number of CPUs on the underlying hardware virtual memory 10/16 Inside a container, the running application cannot see out into processes so much more lightweight than full VMs 1 1/16 running on a single host machine a VMM whose job is to create virtual hardware (simulated 12/16 Video output devices such as graphics Audio devices 13/16 14/16 Hypervisors are usually implemented dedicated micro-OS instances with specialised VMM management tools and 15/16 Economics of Cloud • Virtualisation is all its forms is both a technical enabler and an economic enabler for the Cloud model • There needed to occur critical technology inflection points in compute, storage, network bandwidth for this virtualisation to be possible (early 2000s) • Virtualisation provides the isolation, performance and security characteristics to share hardware and software resources seamlessly • This shareability makes it economically viable to support such concentration and resource pooling 16/16 • Combining with e-commerce infrastructure, payment channels,"
  },
  {
    "text": "compute, storage, network bandwidth for this virtualisation to be possible (early 2000s) • Virtualisation provides the isolation, performance and security characteristics to share hardware and software resources seamlessly • This shareability makes it economically viable to support such concentration and resource pooling 16/16 • Combining with e-commerce infrastructure, payment channels, self-service portals, broadband, user trust, simplified experience and lower operating costs • Hence the Cloud, hence AWS, Google, Azure, etc 17/16 18/16 March 12, 2020 1/31 virtualisation technologies examined in this course Describe the workings and advantages of container Describe the Docker container management system 2/31 and infrastructure-as-code 3/31 A typical service comprises many layers of interoperating Each component has some arbitrary version and configuration A large number of permutations of easily possible with just a 4/31 5/31 Before 1960, most cargo was shipped break bulk. Shippers 6/31 container. The container can be sealed, and not re-opened until it reaches its final destination 7/31 Enables any application and its dependencies to be packaged up as a lightweight, portable, self-sufficient container. Containers have standard operations, thus enabling more 8/31 9/31 A container comprises an application and its dependencies. 10/31 Containers vs VMs • Since all of the containers share the same operating system (and, where appropriate, binaries and libraries), they are significantly smaller than VMs • Possible to store 100s of containers on a physical host • Since they utilize the host operating system, restarting a container does not mean restarting or rebooting the operating system. Thus, containers are much more portable and much more efficient for many use cases. 11/31 • With a traditional VM, each application, each copy of an application, and each slight modification of an application requires creating an entirely new VM. • A new application on a host need only have the application and its binaries/libraries."
  },
  {
    "text": "portable and much more efficient for many use cases. 11/31 • With a traditional VM, each application, each copy of an application, and each slight modification of an application requires creating an entirely new VM. • A new application on a host need only have the application and its binaries/libraries. There is no need for a new guest operating system. 12/31 13/31 Docker is an open source, community-backed project, • application deployment and • component interoperability in complex, multi-node 14/31 • • automating workflows Enables apps to be quickly assembled from components and 15/31 Containers are designed to run on virtually any Linux server. The same container that that a developer builds and tests on Developers can build their application once, and then know that it can run consistently anywhere. Operators can 16/31 17/31 18/31 19/31 Ideally, to make testing easier and to have any kind of objective • It’s a good idea to migrate in small steps anyway 20/31 Suppose that a web service is running a particular version of of Memcached (a memory cache). update will only work with a later version of Ubuntu 21/31 The problem is that the server OS would need to be updated but that update is not qualified to work with the current 22/31 cascades. • This would work but further complicates the deployment mesh • services inside Docker 23/31 Starting with a base image, say some version of Ubuntu, the Docker can animate the image into a running container within the host machine Resources outside the container are not visible to anything 24/31 Updates to the filesystem by in-container applications are Containers have their own virtual networking layer with automatically assigned IP addresses which are visible in the host system 25/31 The philosophy for building a Docker component mesh is to •"
  },
  {
    "text": "machine Resources outside the container are not visible to anything 24/31 Updates to the filesystem by in-container applications are Containers have their own virtual networking layer with automatically assigned IP addresses which are visible in the host system 25/31 The philosophy for building a Docker component mesh is to • • • • 26/31 Docker supports automated, script-driven image generation. A Dockerfile specifies the following: • • Individual software installation commands • • Default command(s) to execute when the container is run 27/31 Consult the latest docs at the official site to see what it 28/31 Support segregation of duties Significantly improves the speed and reliability of continuous Because the containers are so lightweight, address significant 29/31 30/31 • On the other hand, a compromised host server (i.e running Docker Engine) creates a greater exposure 31/31 Docker is an administration suite to manage containers on a single host Docker augments the software distribution management practices of the DevOps movement virtualisation technologies examined in this course 32/31 March 14, 2021 tion stacks 1/20 Motivations for and objectives of a virtualised architectural The principal elements of an operational architecture using Comparing k8s with alternative approaches Illustation of concepts through toy examples on k8s 2/20 Application architectures Consider following implied architectures of a typical enterprise application • The logical architecture describes the logical components and how the are connected to achieve the funcitonal requirements of the application. At this logical view, nothing about how the architecture deployment is considered. This traditionally drives how software is designed and developed • The operational architecture describes how the logical architecture is to be deployed, that is, how software components are mapped to physical or virtualised execution 3/20 environments. This is an increasingly important area of research and design since the advent of ubiquitous networking and cloud"
  },
  {
    "text": "software is designed and developed • The operational architecture describes how the logical architecture is to be deployed, that is, how software components are mapped to physical or virtualised execution 3/20 environments. This is an increasingly important area of research and design since the advent of ubiquitous networking and cloud computing. 4/20 of a an application is concerned concern straddles the logical and operational architectures and 5/20 Monolith to microservices The management of computing resources in the enterprsie has changed significantly since the 1950s to address the new patterns and practice of computer use • In the mainframe era, computing was highly centralised and easily managed • In the PC era, computing became more distributed and democratised but very difficult to manage • In the Internet era, a hybdid of centralised and distributed computing co-exists with an emphasis on centralised management 6/20 Logical architecture design has been forced to respond to and address the increased tendency towards distributed computing norms moving away from monolithic designs to so-called microservices 7/20 and operational architectures. logical subassemblies complexity. 8/20 consistently convert specification into 9/20 philosophy and best-practices infrastrctures Comprises a cluster Logically associates running software components and manages then as units Includes common solutions for connecting, isolating and securing application components Supports external storage associations 10/20 11/20 The master runs the following services: Scheduler Controller manager 12/20 i.e. container or virtual machine Heartbeat monitoring with automatic restart on unexpected or communicating with other components Typically one application or process is assigned per pod Horizontal scaling is achieved by adding or removing pods 13/20 A service is an abstraction of a pod access point Decoupled lifecycle from pod lifecycle cluster the outside using an Ingress 14/20 stored inside the cluster global configuration port numbers, domain names, etc. Suitable for configuration settings which do not"
  },
  {
    "text": "Horizontal scaling is achieved by adding or removing pods 13/20 A service is an abstraction of a pod access point Decoupled lifecycle from pod lifecycle cluster the outside using an Ingress 14/20 stored inside the cluster global configuration port numbers, domain names, etc. Suitable for configuration settings which do not have to be kept confidential is a k8s component for storing secret data such as The management of these configuration elements is intrinsic to the 15/20 k8s Volumes A mechanism for persisting data across the cluster pods. Storage is ot an out-of-box feature of k8s and must be managed consciously • Storage needed for components such as databases or file servers which must be associated and attachable across pod restarts. • Independent from pod lifecycles and locations and resilient to cluster crashes • A PersistentVolume (representing a database, file directory, etc) is an interface to an external storage implementation of your own choice and managed by you (not k8s). Could be: • local storage (not persistent across pod/cluster restarts) • remote network attached storage (persistent) 16/20 • database like ElasticSearch • cloud endpoint like S3, DynamoDB 17/20 is an abstraction over the instances. Descibes the type and access pod restarts. Decouples the storage implementatiom, location and access mechanism from the application Pods can make multiple claims of different types simultaneously allows automatic provisioning of storage of and a 18/20 managed internally by k8s k8s Clusters and replication Running mutiple nodes to host pods and services • A Deployment are pod blueprints that describe how the execution component of an application is to be instantiated. You don’t deal directly with pods • Deployments describe how multiple stateless pods are to be provisioned, replicated and auto-scaled on a k8s cluster • StatefulSets describe deployments of multiple stateful components with shared storage such"
  },
  {
    "text": "blueprints that describe how the execution component of an application is to be instantiated. You don’t deal directly with pods • Deployments describe how multiple stateless pods are to be provisioned, replicated and auto-scaled on a k8s cluster • StatefulSets describe deployments of multiple stateful components with shared storage such as databases. But stateful set synchronisation is managed outside k8s and, therefore, would not share the same volumes. 19/20 • Stateful applications can be challenging to work with inside a clusters (e.g. master-slave) so often provisioned outside the container environment in practice. 20/20 is an abstraction of an external access point which can All application traffic can be directed here Can be associated with third-party proxy implementations 21/20 22/20 Subcommands for interfacing with each of the k8s Supports command-line parameter passing or, more typically, 23/20 build on a single server. This will include the master and worker components and can be managed almost exactly like a multi-server 24/20 March 14, 2020 1/16 One of the three service models defined by NIST The capability provided to the consumer is to deploy onto the cloud infrastructure consumer-created or acquired applications created using programming languages, libraries, services, and tools control the underlying cloud infrastructure including network, deployed applications and possibly configuration settings for the 2/16 In most cases, PaaS can be considered to be theoretically 3/16 4/16 • Lower overall complexity - the Cloud provider takes potentially complex software stacks Specialisation expertise captured within the service Infinitely scalable and highly available resources 5/16 Features and Benefits (Provider) There are significant benefits to providers in adopting this modek and business strateggy because more of the infrastructure is under vendor control • Significantly higher throughput and utilisation so less hardware is needed to do more work and earn more revenue • Higher levels of resource"
  },
  {
    "text": "Features and Benefits (Provider) There are significant benefits to providers in adopting this modek and business strateggy because more of the infrastructure is under vendor control • Significantly higher throughput and utilisation so less hardware is needed to do more work and earn more revenue • Higher levels of resource sharing because the vendor has more options to virualise and isolate tenants • Less costly to manage because the tooling and technologies can be specialised and optimised 6/16 • Smaller surface area exposed to customers so there is less to support and less to go wrong • More secure because the customer has less access and control • Greater stickiness for customer capture making future revenue more likely 7/16 • Disaggregation of services (service-oriented architectures and microservices) • • Less concern with vendor-lock-in • • • Identity managem ent 8/16 • Less portable, technically-detailed solutions Harder to migrate to alternative vendors • Features • • Technical effort Likely part of a deliberate vendor strategy 9/16 Servers, storage, network infrastructure exclusively managed • Operating systems maintenance • • • • • Software updates and patching Application data and software managed by the customer 10/16 Machine learning Identity and access management 11/16 through • Free pricing tiers • • Opportunities for skills development • • This is an important part element of the vendor marketing 12/16 13/16 14/16 Customer has already made the strategic commitment to cloud outsourcing 15/16 PaaS services are not a good fit for existing on-premise or • This is would require significant rework which is not considered • • Can do better with roll-your-own or Iaas 16/16 Customer enjoy higher-order building blocks with less to manage 17/16 CMPU3055 Cloud Computing Evolution of Cloud - Recap ● Born of opportunity to monetise excess compute and storage capacity ● Closely"
  },
  {
    "text": "is would require significant rework which is not considered • • Can do better with roll-your-own or Iaas 16/16 Customer enjoy higher-order building blocks with less to manage 17/16 CMPU3055 Cloud Computing Evolution of Cloud - Recap ● Born of opportunity to monetise excess compute and storage capacity ● Closely mirrors expected customer adoption patterns ● Growth strategy: ○ Facilitate early easy wins (on-premise migration) ○ Build developer mindshare (focusing on technical benefits) ○ Low-friction adoption (tooling and migration services) ○ Rapid capacity growth to defend against new market entrants ○ Proprietary service build-out (e.g. AWS Aurora, serverless computing) 2 ● Now challenging traditional system architecture thinking altogether Serverless Computing [1] ● An umbrella term meaning computing services for which enduser does not need to explicitly manage the underlying supporting computing resources ● Obviously there are servers! ● But they are transparent ● Represents a natural evolution of cloud services abstraction 3 Serverless Computing [2] ● Emphasis on building (higher-level blocks) rather than managing (eliminating cloud stack complexity) ● Greater infrastructure utilisation and multi-tenancy density ● Synonyms and conflations: ○ Backend-as-a-service ○ Functions-as-a-service 4 Serverless Computing in Comparison Conventional service (in the cloud) Serverless service Database instance (e.g. RDS) Key-value store (e.g. AWS DynamoDB) Block storage (mounted on virtual instance) API-addressed bucket storage (e.g. AWS S3) Reverse Proxy or Load Balancer (e.g. NGINX) Configurable Gateway (e.g. AWS API Gateway) Virtual Machine or Container Instance Funcion-as-a-service (e.g. AWS Lambda, Cloudflare workers) 5 Bespoke, standalone authentication node Auth-as-service identity management (e.g. Auth0) Potential Benefits ● Lower relative operational cost ● Lower relative development cost ● Automatic scaling (in and out) ● Lower operational complexity ● Faster deployment ○ Fine-grained usage charges ○ Focus effort only on direct value add (code and data) ○ Fine-grained elastic resizing proportional to usage ○ Less to"
  },
  {
    "text": "Potential Benefits ● Lower relative operational cost ● Lower relative development cost ● Automatic scaling (in and out) ● Lower operational complexity ● Faster deployment ○ Fine-grained usage charges ○ Focus effort only on direct value add (code and data) ○ Fine-grained elastic resizing proportional to usage ○ Less to manage 6 ○ Less to deploy and update in refresh cycles Functions-as-a-Service ● On-demand execution of user-defined code fragments in response to some specified event(s) ○ HTTP API Request ○ File update on bucket storage ○ Message queue event or a timer event ● Code executes in isolated, virtual environment to completion and then unloads ● Optional temporal caching (for efficient re-execution) 7 ● Access to other cloud services (e.g. databases) ● Zero-infrastructure management for users, infinitely scalable 8 Deployment Size (FaaS) ● Although called functions-as-a-service, the real distinction is the size and content of the deployed asset ● In VMs, we deploy whole application stacks including OS; with containers we just deploy the runtime application file system image ● In FaaS, we just deploy code; Either source code to be interpreted or byte code or machine code to be executed ● FaaS represents the smallest logical composable execution unit; promotes a componentization approach to development; think microservice architectures ● This also make FaaS apps fast to deploy and update 10 CASE STUDY: AWS API Gateway, AWS Lambda ● URL endpoints mapped to AWS Lambda functions (entry points to event handling logic) ○ Variety of languages supported ○ Dozens of 3rd-party helper frameworks emerging ● Typically, performs some database or file object access ● Theoretically, each event execution creates independent AWS Lambda execution context 11 ● Execution contexts isolated and virtualised from each other ○ Speculation is that these are containerised ○ Although temporal caching may be in effect CASE"
  },
  {
    "text": "3rd-party helper frameworks emerging ● Typically, performs some database or file object access ● Theoretically, each event execution creates independent AWS Lambda execution context 11 ● Execution contexts isolated and virtualised from each other ○ Speculation is that these are containerised ○ Although temporal caching may be in effect CASE STUDY: AWS API Gateway, AWS Lambda ● Fine-grained Identity and Access Management (IAM) policies can be applied to control cloud resource access ● Basic logging with advanced monitoring through AWS CloudWatch 12 How Does Serverless Work? Different vendors using different approaches. All require low-latency virtual execution environments implemented transparently ● Hypervisor virtual machines (e.g. AWS Lambda Firecracker) ● Containers (e.g. Azure App Service) ● Language runtimes (e.g. Cloudflare workers on NodeJS) ● Web Assembly Runtimes (e.g. Fastly) Web Assembly Runtimes ● WASM is a stack machine executed byte code originally developed as a fast runtime for browsers ● Multiple source languages already target WASM (E.g. C, C++, Rust, Go, etc) ● Bytecode can be compiled to native assembly for performance ● Portable execution format ● Very fast startup and execution times ● Sandboxed execution environment with strong emphasis on system security ● Gaining a lot of traction in the cloud world as a lightweight replacement for (simple) Docker workloads 14 Potential Disadvantages of Serverless (1) ● Vendor control ○ Simplicity-of-delivery comes at the cost of fewer features and less flexibility ○ Homogenized one-size-fits-all ● Multi-tenancy sharing ○ By definition, higher infrastructure utilization implies resource sharing ○ Harder to make guarantees about execution runtimes ● Vendor lock-in ○ No industry standards means vendor-led de facto standards ○ Likely impediment to porting to competitor platform Potential Disadvantages of Serverless (2) ● Potential repetition of (code) logic ○ A particular concern of FaaS ○ Harder to organise code for maximum sharing across execution"
  },
  {
    "text": "about execution runtimes ● Vendor lock-in ○ No industry standards means vendor-led de facto standards ○ Likely impediment to porting to competitor platform Potential Disadvantages of Serverless (2) ● Potential repetition of (code) logic ○ A particular concern of FaaS ○ Harder to organise code for maximum sharing across execution contexts ● Loss of control over server implementation ○ Server details are transparent so apps cannot take advantage of any server-side bespoke tuning/configuration ● No natural server-side statefulness ○ Execution contexts are ephemeral ○ App logic must explicitly manage state across invocations (e.g. 16 Database) Potential Disadvantages of Serverless (3) ● Startup latency ● Execution latency ● Testing ○ The so-called “cold start” problem ○ Making new database connections for every execution ○ More difficult to test locally before deployment ○ Likely very different from ultimate target execution environment 17 The Likely Future Ahead ● We can speculate on the impact of serverless but it is likely, in the near term, that the trend towards serverless will continue ● Suits vendors ○ Easier to offer, manage and support ○ Sticky ● Suits users ○ Easier to adopt, refresh and scale ○ Cost benefits ● But potentially represents a significant tipping of control towards vendors 18 1/20 2/20 Public clouds represent a significant transfer of ownership of the hosting and access infrastructure Magnitude of this transfers is on a continuum depending on No existing analagous counter movement advocating for users’ freedoms; Projects such as Openstack have largely overtaken by technical innovation 3/20 have to trust these with very little transparently or Longevity, sustainability, financial soundness, withdrawl of 4/20 called ; Access, ownership and monetisation Many state and trans-state actors slow to appreciate the shift in power and control; Asia region push-back the notible 5/20 The nexus of cloud computing serivces and"
  },
  {
    "text": "3/20 have to trust these with very little transparently or Longevity, sustainability, financial soundness, withdrawl of 4/20 called ; Access, ownership and monetisation Many state and trans-state actors slow to appreciate the shift in power and control; Asia region push-back the notible 5/20 The nexus of cloud computing serivces and the explosion in of data by concentrated private-interest actors services that generates the data; Captures the data as it is generated; Re-sells valued-added services from data mining 6/20 data and ensuring no unathorised access occurs. What is their What is the overarching governance model of cloud? Who funds its enforcement? E.g. national data protection Specific local and international consumer protection legislation 7/20 Training datasets for supervised machine learning and model Artificial intelligence at the forefront of the forth industrial • • • 8/20 How easy is it be heard on the Internet? Easy to publish but not Search ranking algorithms prioritize results according to the Commericial motivations such as advertising revenue Cultural and political belief systems of founders and major could state regulators do any better? What unintended 9/20 Represented the first significant revelation of the intimate and direct funding of tech giants by Western governments; Direct recipients of government contract revenue 10/20 China has banned western big tech from providing cloud US trade santions on Chinese companies and key technology Taiwan flexing its current dominance in 5nm semi-conductor tech and the risk that it can be controlled and minipulated for geopolitical ends 11/20 can we make that could tip the scales back in our favour? 12/20 The legal jurisdiction of choice will govern how your data and Often will be stronger through a citizenship relationship Providers must be subject to cosumer protection law and that it must be enforcable at the national state or trans-national Being enforcable means being"
  },
  {
    "text": "the scales back in our favour? 12/20 The legal jurisdiction of choice will govern how your data and Often will be stronger through a citizenship relationship Providers must be subject to cosumer protection law and that it must be enforcable at the national state or trans-national Being enforcable means being sufficiently funded, having the The legal protections must be able to keep up with 13/20 to necessarily rely on big tech for any or all of those IT services. Of course, big tech makes it hard to do this! Other (e.g. phone services like weather, maps, etc) Also consider diversification across your providers 14/20 Is open source broken? Cloud is signigicantly re-propietarising anymore under legacy licensing regime? This seems highly What does this mean for the running of Operating systems 15/20 One approach is to self-host your key cloud services. The You are the administrator; responsible for installing, patching, 16/20 centralised cloud. The potential benefits include: Location independence because it’s distributed Truly massive resource sharing But does it work unless most participants are contributing their fair 17/20 WebRTC is an existence proof that peer-to-peer technologies can Highly scalable architecture, limited only by resource Support for lightweight messaging and high volume media 18/20 Non-intermediated trust protocols for financial and trading But contoversial and open questions remain: Speculative bubbles, corruption and criminality in early Concentration of control of mining pools is a central contradiction of decentralisation 19/20 P2P file sharing and storage • Bit-torrent is a P2P file sharing protocol comprising seeders and leachers. Seeders offer parts of files to the network while leachers copy then down. As soon as a sufficent number of bytes have been copied to a node, then those also become available to be copied back to the network; The protocol is an attempt to provide load-balanced, distributed"
  },
  {
    "text": "and leachers. Seeders offer parts of files to the network while leachers copy then down. As soon as a sufficent number of bytes have been copied to a node, then those also become available to be copied back to the network; The protocol is an attempt to provide load-balanced, distributed sharing • Interplenary File Service (IPFS) is a deduplicated, block-hashed distributed file system in which participating nodes some, but not necessarily all, of a file’s blocks. The IPFS protocol allows addressable reads and writes by automatically assembling or distributing block across the network. Theoretically, IPFS 20/20 storage is immutable and append-only because of the large number of redundant copies of constituent file blocks 21/20"
  },
  {
    "text": "Programming Paradigms and Data Structures Week 2: Algorithms Introduction February11,2019 Motivation Why study algorithms? Theirimpactisbroadandfar-reachin..g... Internet. WebsearchNpacketroutingNdistributedfilesharingN... Biology. HumangenomeprojectNproteinfoldingN… Computers. CircuitlayoutNfilesystemNcompilersN… Computergraphics. MoviesNvideogamesNvirtualrealityN… Security. CellphonesNe-commerceNvotingmachinesN… Multimedia. MP3NJPGNDivXNHDTVNfacerecognitionN… Socialnetworks. RecommendationsNnewsfeedsNadvertisementsN… Physics. N-bodysimulationNparticlecollisionsimulationN… ⋮ 1 Why study algorithms? Oldroots,new opportunities. StudyofalgorithmsdatesatleasttoEuclid. FormalisedbyChurchandTuringin1930s. Activityreachedapeakduringthe1970s. ECB003 s0291 s0391 s0491 s0591 s0691 s0791 s0891 s0991 s0002 2 Why study algorithms? Forintellectualstimulation. FVRXOIMTOTRHSV THVJOYOFqLGORITHMS “Forme,greatalgorithmsarethepoetryofcomputation.Just FrancisSullivan(qssociateVditor’in’Yhief l B a i s k u p e t e o v c e n t r c o s e f e u , co n th m lo e p y ck u c e t a i d n n , g t b . h e e ” t y e c rs a — e s , t F a a l r l b a u r n s i i c l v l i i e s a , S n d u t e l n n li e s v w e a , n l a ig n h d t e o v n en so m m y e sterious. Sc?e6rxriwvetcsgpvcpltaMLtdcJ a n T o i hp ii u r b o h he ve sL a L e o u u m tt a r e a t ee n er s o v l nY L T Fa h r i h ! t gb m h t c w a i e b n n c t s s h r e ne at o mqs mo m er o t a M i e o oh ’ju ie o i t e s k h g i l r r t o c m w a b ns r c l id m n u s i l e a ( t"
  },
  {
    "text": "at o mqs mo m er o t a M i e o oh ’ju ie o i t e s k h g i l r r t o c m w a b ns r c l id m n u s i l e a ( t r ss e q ’e y e h o t e s a s k n a e e di g t cp h m ’ s a ( c m fl w s t h r a f fi p n a r e n ir t ta o s e i p l o ta c n p Ipn ty h n e i a L o u w r p o et e e m u pt e r l fm v bt r g l a av s u s e g n t r y ( u r e c a a h r a no c e t u m r l a r em s r p e e s a u w l eg n an y e t h t oei r t i i g p a a y y d s u tn hl l a c d in x ua s rs c d f o a l t a y l — r e o p gf t i d a p g ee b h ( t g e ee t s e l n e e t sc s a a n o a hi t o t o S (a v to o o h i s a e x s o t c t t y a ia p s h f i s a e t a n f i r i"
  },
  {
    "text": "e t sc s a a n o a hi t o t o S (a v to o o h i s a e x s o t c t t y a ia p s h f i s a e t a n f i r i hs bo u o r nt c e t t o t n e i t o l fo e nd c h s i o n g a e a b o m a eto n e o c i r t a “ n l y r n w c n r lr o e e l o n m h es o te t r r s h l na g e t g ! t e ( h h di g y d f t ( e t a e w o h t n m b v a g t t o e Ww d o o ( d o s e eo s o h p h h f r e eo s !c VL c c hn T r w o t r s ” e r r d e n t f t r b e r i t i o e e io fai ! t e i r a n ns N h V f t w i o e h y n w ’ a s t t e s s b s n t u t i t e t h ’n I h n e s h e i e g b uh l v e h e Y o s s - n la O d s l t i t m l t i r m e d h m n l e c b"
  },
  {
    "text": "e t h ’n I h n e s h e i e g b uh l v e h e Y o s s - n la O d s l t i t m l t i r m e d h m n l e c b t o m t io e o s h h r r t ! as o e e T n e a y iW e r u h e t U o e o f e b r a n c m s c c na r v v d s s mg s c v e e e i k ( V a t lt e k y t a o o v e s e 0 a e s t e G a a s h a f a l n a c e i l s a e d h e r m d s r ! mv X i sr s r i tt l r s e o n n a y s u e m i t i r r H c o e Ne h e y at e l z o wb h rp m h s d e hg r !g r m a v( m n e p - HS i “ e ’ s e n e i a — y e o ’ lt b e s a t a e g m ( p 1t rT ! C e e a f m h h ( h t aw o e O s t n r i V o e u a b et x nb Io l n a— m e a q a I a s a H i t p s e b w"
  },
  {
    "text": "C e e a f m h h ( h t aw o e O s t n r i V o e u a b et x nb Io l n a— m e a q a I a s a H i t p s e b w i m sl i n o u m ed u E f ot v a t d t c l n e a t t t p N a p t l t y d T e o l y i a r c a n i V t a t c n t p N u u h g b o b u t e ! f m n e h o h v y w a un s n h s ho n X a o f o H s e tr l o n V ’k m C e e e T st y a c i n m i h r et e u e f r r r n d h z e t oe vt c a io o t V i s E X e o eo e P a le c O e i r o x i i d t f sa n e e c ts a r ng d s s e n yh l m y n n ! p uu M V f n e h ls ( (t r e o t g P d h r y c o I m e t t e e nrs i u if t & t x “ od R e e g ( n ! l a n m s t o a i l c h V d w ’ e t i t W i"
  },
  {
    "text": "r y c o I m e t t e e nrs i u if t & t x “ od R e e g ( n ! l a n m s t o a i l c h V d w ’ e t i t W i n - n d cd n ’ f i e s “ y l d v H ti r n ( b e g se g k a a q L q n oe e r tgs c a e t a y u u f n E p u a a a t l i h o O c w d h r q o w n o S s ( f f st e q sn f l l oi lv e e fi t d n N e e t o g l e t m t fi f l ! P u eo c e w F g e e cd w a s L i o ( o eoi a c o s i n T s r oca r G n ( n ta r S l f v ca p f n e ( n o a e e G t(g r al y i n c i st g T i pyt h h s t l n n r i u I r r a r n e F n M oh l o e s a ’ y t h s s i N s r h f u O e ’ e r e i hi dt h m ( o t ! H e z r t O i u t o n n e c c i a n u i o tm oi a e a"
  },
  {
    "text": "s s i N s r h f u O e ’ e r e i hi dt h m ( o t ! H e z r t O i u t o n n e c c i a n u i o tm oi a e a m Ym s E c aa l n R y e u g t h o g t a e en O t n n I ov nb o h ll i m m“ i r s E u t r o v o S gg I c i a o g t itr oa f g m f u i m e e d c o LT n e h c n h a n i n e o oo R o r p s a n n s e a l s s h n n ng’ e e ye F e a I ’ ’ ’ r ’ ’ r ’ ’ s s s t H ( I ( ! l ! ! SNI H R M GS motw-ttnunhdlpflwiIoalteoctogpi SV s s e e u h e h i sb o f T W l a ehf p t n a o eo o m a h n mfi e m y n mh v o N a I r l R I T m O t t t x t y t r a w y ’ ( mo e g s S y c eh a h st i o u e a t i t s s s O p h t e m w o h O i l r z e p F ti e r enit c u m g ! e - i i e he ct s nhy"
  },
  {
    "text": "eh a h st i o u e a t i t s s s O p h t e m w o h O i l r z e p F ti e r enit c u m g ! e - i i e he ct s nhy c t a s a m e n s u r or e o F r s d h g e q i n 8 i e r U e a I v T ga t eze l pn i u c t s me n a s o o nL t n n t i ’ l i ’ t e e o t L ’ a a t e m o f t e d G ot r g v H h T a ei L m h t w pe s a w t u e t i e c p x c n c p a m G o u n n w ti l i e ( e n ao o ! h s s t H h d t u H o o l o s V aa g a t l r o d b l r ! n d H i d p i e u O a o d y e n t n i o l r tn a c y a n an u r Q — t ( d i V h u cns l Y e r e st u l! e c l s n a i c o nid t e g t R m b i k s gn m f uc a j en a a r ef I l ’ t t o o e g V fi ! T c w"
  },
  {
    "text": "e st u l! e c l s n a i c o nid t e g t R m b i k s gn m f uc a j en a a r ef I l ’ t t o o e g V fi ! T c w u o t t b o io s l nh w t n v YI f s t s t q f o n n i a o b cr u t N T r e e i u h f a oo r a ne o s O o a l a s n oi g V s g ! e ot r si n w v ct i me e nf s n ft d s t p H f a t r m n T y t h fa u e o o n t N d w o n t f h Y l i cc r e s u ui a s h n c eo g y l l r i t te r U ’ e o o M N c r mh l a v c s n t pso q m T em e f y a r l r m a u m e e t k p i i u -u r t ! n j m t R a e Pn c i L m d ! S x t o e v o U r oo o i aa no Wn Q e c oi t h h p o g Y d m e - ’ ! f k s L H t t r p u b h ntc u k a l t R i s h c u i n n e e"
  },
  {
    "text": "i aa no Wn Q e c oi t h h p o g Y d m e - ’ ! f k s L H t t r p u b h ntc u k a l t R i s h c u i n n e e s !o h mi u h a t ul c n ns e e o n i ” n g o t I d e e e t T ii t n Y c p oh e e m d t “ d a g n y os i N d l o o ig m r m c k i g ’ d s n e o t n s e c H se n v r n d ee l i ( m t r j e c f s r o n i d g t I s e p e u p a s irn ! a s g b r k d i e S V o s o np ! t g ! g s a u rf o t l F d T o a t e ( ke s q ( o ei tn S e a nm u q efi T a s c f i q u c m l t c a e - t ul t h t s c s y r s U r y r o h t d o h a n nt e g i L e h o Y i c e t d y c e c o a u le r o g e t i ho k d e b a ( l c V a e o e h e e o V e c l n p"
  },
  {
    "text": "g i L e h o Y i c e t d y c e c o a u le r o g e t i ho k d e b a ( l c V a e o e h e e o V e c l n p n l T y a s i f s x ao ii t s e r r v v l d a c cee a d n w e a r c h X t t r l e e ( b e d cp e l ( o h d v O t e o h lr e s d d gia h h l a e n ” e q t r e n e s a a u a b a e w d W oq o s h i e i d o e F tp r o r g m n c g t g M t ns h t d l y u fu n y e eo d a r e t f o uw s d e ww a a t t V h e o e“ s tc m r u a C r P r e t t h( r s w k h pa i l s i o a kb b a e h e rh r t d t c m y m t e L O t s s e s r r i e t h i s ( i m l r e he t e f i ss ( W l l e e e t c i u V ir o i l e p t m M l l u o r i a f c l tr s v m"
  },
  {
    "text": "h i s ( i m l r e he t e f i ss ( W l l e e e t c i u V ir o i l e p t m M l l u o r i a f c l tr s v m a c f v pt e h nt n l u n n o b ov l m e s S o r ! o h e r ei i n f V i ut e g u P l d a o s s e e s s o s oe g g T u n n i ea W tu e s! w n f ed w R a r p U r ! hu qe s fn a e r t o i th hly g mr r t i ib l F i et u s q t t u s o o V d n r s i T o y m p o V e ii u n r l n b r c oo e n f o o eo r a c re u nme w y I p e ’ ec i kg s n i i a f t r e n n e k r r ’ V N s p e e s g Q ’ w t i l f e s t a ( a o a e ot i r o mat - l q i o i t p s a V la GO t i o b li c o n n a i x o a r n l f e r l e l u h f nrs m a J h i t n c i a u s r"
  },
  {
    "text": "i o i t p s a V la GO t i o b li c o n n a i x o a r n l f e r l e l u h f nrs m a J h i t n c i a u s r s oo s S o L g g a aa t t i t t e r a t go h m a a t o I h h h h e n g b n n V n p o h h r o r oo o t e X s l N i i n d e y e e e e e ’’ ’ ’ ’ ’ ’ ’ ’ s ’ t t t t f ff f ! ’ x YOMPUTINGINSYIVNYVwVNGINVVRING Tobecomeabetterprogrammer “Iwill,infact,claimthatthedifferencebetweenabadprogrammer andagoodoneiswhetherheconsidershiscodeorhisdatastructures moreimportant.Badprogrammersworryaboutthecode.Good programmersworryaboutdatastructuresandtheirrelationships.” —LinusTorvalds(creatorofLinux) 3 Why study algorithms? “AlgorithmskDataStructures=Programs.” —NiklausWirth Theymayunlockthesecretsoflifeandoftheuniverse. “Computermodelsmirroringreallifehavebecomecrucialformost advancesmadeinchemistrytoday….Todaythecomputerisjustas importantatoolforchemistsasthetesttube.” — RoyalSwedishAcademyofSciences (NobelPrizeinChemistry2013) 4 Why study algorithms? Tosolveproblemsthatcouldnototherwisebeaddressed. e.g. twogalaxiesinteracting. 5 Why study algorithms? Forfunandprofit. 6 Why study algorithms? Theirimpactisbroadandfarreaching. Oldroots,new opportunities. Forintellectualstimulation. Tobecomeabetterprogrammer. Theymayunlockthesecretsoflifeandoftheuniverse. Tosolveproblemsthatcouldnototherwisebeaddressed. Forfunandprofit. Whystudyanythingelse? 7 Preliminaries Methodology Stepstodevelopingausablealgorithm. Modeltheproblem. Findanalgorithmtosolveit. Fastenough?Fitsinmemory? Ifnot,figureoutwhynot. Findawaytoaddresstheproblem. Iterateuntilsatisfied. 8 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? 0 1 2 3 4 5 6 7 8 9 9 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 0 1 2 3 4 5 6 7 8 9 10 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 5 6 7 8 9 11 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 5 6 7 8 9 12 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 5 6 7 8 9 13 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8"
  },
  {
    "text": "1 2 3 4 connect6and5 5 6 7 8 9 12 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 5 6 7 8 9 13 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 14 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 are0and7connected? 15 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 are0and7connected? are8and9connected? ✔ 16 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 are0and7connected? are8and9connected? ✔ connect5and0 17 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 are0and7connected? are8and9connected? ✔ connect5and0 connect7and2 18 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 are0and7connected? are8and9connected? ✔ connect5and0 connect7and2 connect6and1 19 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 are0and7connected? are8and9connected? ✔ connect5and0 connect7and2 connect6and1 connect1and0 20 Problem Description GivenasetofNobjects,support2operations: Connecttwoobjects. Isthereapathconnectingthetwoobjects? connect4and3 connect3and8 0 1 2 3 4 connect6and5 connect9and4 connect2and1 5 6 7 8 9 are0and7connected? are8and9connected? ✔ connect5and0 connect7and2 connect6and1 connect1and0 are0and7connected? ✔ 21 Much bigger problem Q.Isthereapathconnectingpandq? p q 22 Much bigger problem Q.Isthereapathconnectingpandq? p q A. Yes. 23 Modelling Objects Applicationsinvolvemanipulatingobjectsofalltypes Pixelsinadigitalphotos. Computersinanetworks. Friendsinasocialnetworks. Transistorsinacomputerchips. Elementsinamathematicalsets. VariablenamesinaFortranprograms. Metallicsitesinacompositesystems. 24 Modelling Objects Applicationsinvolvemanipulatingobjectsofalltypes Pixelsinadigitalphotos. Computersinanetworks. Friendsinasocialnetworks. Transistorsinacomputerchips. Elementsinamathematicalsets. VariablenamesinaFortranprograms. Metallicsitesinacompositesystems. Whenprogramming,convenienttonameobjects0toN-1. Useintegersasarrayindices. Suppressdetailsthatarenotrelevant. 25 Modelling the connections Weassume\"isconnectedto\"hasthefollowingproperties: pisconnectedtopi.e.everyobjectisconnectedtoitself. ifpisconnectedtoq,thenqisconnectedtop ifpisconnectedtoqandqisconnectedtor, thenpisconnectedtor. 26 Modelling the connections Weassume\"isconnectedto\"hasthefollowingproperties: pisconnectedtopi.e.everyobjectisconnectedtoitself. ifpisconnectedtoq,thenqisconnectedtop ifpisconnectedtoqandqisconnectedtor, thenpisconnectedtor. Connectedcomponent. Maximalsetofobjectsthataremutuallyconnected. 0 1 2 3 4 5"
  },
  {
    "text": "Modelling Objects Applicationsinvolvemanipulatingobjectsofalltypes Pixelsinadigitalphotos. Computersinanetworks. Friendsinasocialnetworks. Transistorsinacomputerchips. Elementsinamathematicalsets. VariablenamesinaFortranprograms. Metallicsitesinacompositesystems. 24 Modelling Objects Applicationsinvolvemanipulatingobjectsofalltypes Pixelsinadigitalphotos. Computersinanetworks. Friendsinasocialnetworks. Transistorsinacomputerchips. Elementsinamathematicalsets. VariablenamesinaFortranprograms. Metallicsitesinacompositesystems. Whenprogramming,convenienttonameobjects0toN-1. Useintegersasarrayindices. Suppressdetailsthatarenotrelevant. 25 Modelling the connections Weassume\"isconnectedto\"hasthefollowingproperties: pisconnectedtopi.e.everyobjectisconnectedtoitself. ifpisconnectedtoq,thenqisconnectedtop ifpisconnectedtoqandqisconnectedtor, thenpisconnectedtor. 26 Modelling the connections Weassume\"isconnectedto\"hasthefollowingproperties: pisconnectedtopi.e.everyobjectisconnectedtoitself. ifpisconnectedtoq,thenqisconnectedtop ifpisconnectedtoqandqisconnectedtor, thenpisconnectedtor. Connectedcomponent. Maximalsetofobjectsthataremutuallyconnected. 0 1 2 3 4 5 6 7 { 0 } { 1 4 5 } { 2 3 6 7 } 3connectedcomponents 27 Implementing the operations Find. Inwhichcomponentisobjectp? Connected. Areobjectspandqinthesamecomponent? 28 Implementing the operations Find. Inwhichcomponentisobjectp? Connected. Areobjectspandqinthesamecomponent? Union. Replacecomponentscontainingobjectspandqwiththeirunion. 0 1 2 3 uniong2,5) 4 5 6 7 { 0 } { 1 4 5 } { 2 3 6 7 } 3connectedcomponents 29 Implementing the operations Find. Inwhichcomponentisobjectp? Connected. Areobjectspandqinthesamecomponent? Union. Replacecomponentscontainingobjectspandqwiththeirunion. 0 1 2 3 0 1 2 3 uniong2,5) 4 5 6 7 4 5 6 7 { 0 } { 1 4 5 } { 2 3 6 7 } { 0 } { 1 2 3 4 5 6 7 } 3connectedcomponents 2connectedcomponents 30 API Goals: Designefficientdatastructureforunion-find. NumberofobjectsNcanbehuge. NumberofoperationsMcanbehuge. Unionandfindoperationsmaybeintermixed. 31 API Goals: Designefficientdatastructureforunion-find. NumberofobjectsNcanbehuge. NumberofoperationsMcanbehuge. Unionandfindoperationsmaybeintermixed. class UF initializeunion-finddatastructure UF(int N) withNsingletonobjects(0toN–1) union(int p, int q) addconnectionbetweenpandq int find(int p) componentidentifierforp(0toN–1) boolean connected(int p, int q) arepandqinthesamecomponent? 32 API Goals: Designefficientdatastructureforunion-find. NumberofobjectsNcanbehuge. NumberofoperationsMcanbehuge. Unionandfindoperationsmaybeintermixed. class UF initializeunion-finddatastructure UF(int N) withNsingletonobjects(0toN–1) union(int p, int q) addconnectionbetweenpandq int find(int p) componentidentifierforp(0toN–1) boolean connected(int p, int q) arepandqinthesamecomponent? 1-lineimplementation public boolean connected(int p, int q) { return find(p) == find(q); } 33 Quick-find Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 34 Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 35 Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 0,5and6areconnected id[] 0 1 1 8 8 0 0 1"
  },
  {
    "text": "Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 35 Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 0,5and6areconnected id[] 0 1 1 8 8 0 0 1 8 8 1,2,and7areconnected 3,4,8,and9areconnected 0 1 2 3 4 5 6 7 8 9 36 Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 Find. Whatistheidofp? Connected. Dop andq havethesameid? 37 Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 Find. Whatistheidofp? id[6] = 0;id[1] = 1 6and1arenotconnected Connected. Dop andq havethesameid? 38 Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 Find. Whatistheidofp? id[6] = 0;id[1] = 1 6and1arenotconnected Connected. Dop andq havethesameid? Union. Tomergecomponentscontainingpandqchangeallentries whoseidequalsid[p]toid[q]. 39 Quick-find Datastructure. Integerarrayid[]oflengthN. Interpretation: id[p]istheidofthecomponentcontainingp. 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 Find. Whatistheidofp? id[6] = 0;id[1] = 1 6and1arenotconnected Connected. Dop andq havethesameid? Union. Tomergecomponentscontainingpandqchangeallentries whoseidequalsid[p]toid[q]. 0 1 2 3 4 5 6 7 8 9 id[] 1 1 1 8 8 1 1 1 8 8 afterunionof6and1 problem:manyvaluescanchange 40 Demo 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 4 5 6 7 8 9 41 Demo union(4,3) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[]"
  },
  {
    "text": "5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 4 5 6 7 8 9 41 Demo union(4,3) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 4 5 6 7 8 9 42 Demo union(4,3) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 3 5 6 7 8 9 43 Demo union(3,8) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 3 5 6 7 8 9 44 Demo union(3,8) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 8 5 6 7 8 9 45 Demo union(6,5) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 8 5 6 7 8 9 46 Demo union(6,5) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 8 5 5 7 8 9 47 Demo union(9,4) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 8 5 5 7 8 9 48 Demo union(9,4) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 8 5 5 7 8 8 49 Demo"
  },
  {
    "text": "7 8 9 id[] 0 1 2 8 8 5 5 7 8 9 48 Demo union(9,4) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 8 5 5 7 8 8 49 Demo union(2,1) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 8 5 5 7 8 8 50 Demo union(2,1) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 5 5 7 8 8 51 Demo connected(8,9) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 5 5 7 8 8 52 Demo connected(8,9) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 5 5 7 8 8 alreadyconnected! 53 Demo connected(5,0) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 5 5 7 8 8 54 Demo connected(5,0) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 5 5 7 8 8 notconnected! 55 Demo union(5,0) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 5 5 7 8 8 56 Demo union(5,0) 0 1 2 3 4 5 6 7 8"
  },
  {
    "text": "7 8 8 notconnected! 55 Demo union(5,0) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 5 5 7 8 8 56 Demo union(5,0) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 7 8 8 57 Demo union(7,2) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 7 8 8 58 Demo union(7,2) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 59 Demo union(6,1) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 8 0 0 1 8 8 60 Demo union(6,1) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 1 1 1 8 8 1 1 1 8 8 61 Cost Analysis Costmodel. Numberofarrayaccesses(forreadorwrite). algorithm initialize union find connected quick-find N N 1 1 orderofgrowthofnumberofarrayaccesses quadratic Unionistooexpensive. IttakesN2arrayaccessestoprocess asequenceofNunionoperationsonNobjects. 62 Cost Analysis Roughstandard(fornow). 109operationspersecond. 109wordsofmainmemory. Touchallwordsinapproximately1second. 63 Cost Analysis Roughstandard!fornow). 109operationspersecond. 109wordsofmainmemory. Touchallwordsinapproximately1second. Ex.Hugeproblemforquick-find 109unioncommandson109objects. Quick-findtakesmorethan1018operations. 30+yearsofcomputertimey 64 Cost Analysis Roughstandard+fornow!v 429operationspersecondv 429wordsofmainmemoryv Touchallwordsinapproximately4secondv ExvHugeproblemforquickWfind 429unioncommandson429objectsv QuickWfindtakesmorethan4248operationsv 32Byearsofcomputertime1 time quadratic 64T Quadraticalgorithmsdon3tscalewithtechnology Newcomputermaybe42xasfastv But,has42xasmuchmemory⇒ 3KT Wanttosolveaproblemthatis42xasbigv Withquadraticalgorithm,takes42xaslong1 46T linearithmic 8T linear size KK 4K 4K 8K 65 Quick-union Quick-union Datastructure. Integerarrayid[]oflengthN. keepgoinguntilitdoesn’tchange Interpretation:id[i]isparentofi. Rootofiisid[id[id[...id[i]...]]]. 0 1 9 6 7 8 0 1 2 3 4 5 6 7 8 9 id[]"
  },
  {
    "text": "429operationspersecondv 429wordsofmainmemoryv Touchallwordsinapproximately4secondv ExvHugeproblemforquickWfind 429unioncommandson429objectsv QuickWfindtakesmorethan4248operationsv 32Byearsofcomputertime1 time quadratic 64T Quadraticalgorithmsdon3tscalewithtechnology Newcomputermaybe42xasfastv But,has42xasmuchmemory⇒ 3KT Wanttosolveaproblemthatis42xasbigv Withquadraticalgorithm,takes42xaslong1 46T linearithmic 8T linear size KK 4K 4K 8K 65 Quick-union Quick-union Datastructure. Integerarrayid[]oflengthN. keepgoinguntilitdoesn’tchange Interpretation:id[i]isparentofi. Rootofiisid[id[id[...id[i]...]]]. 0 1 9 6 7 8 0 1 2 3 4 5 6 7 8 9 id[] 0 1 9 4 9 6 6 7 8 9 2 4 5 3 parentof3is4 rootof3is9 66 Quick-union Datastructure. Integerarrayid[]oflengthN. Interpretation:id[i]isparentofi. Rootofiisid[id[id[...id[i]...]]]. 0 1 9 6 7 8 0 1 2 3 4 5 6 7 8 9 id[] 0 1 9 4 9 6 6 7 8 9 2 4 55 q p 33 Find. Whatistherootofp? rootof3is9 rootof5is6 Connected. Dopandqhavethesameroot? 3and5arenotconnected 67 Quick-union Datastructure. Integerarrayid[]oflengthN. Interpretation:id[i]isparentofi. Rootofiisid[id[id[...id[i]...]]] Union. Tomergecomponentscontainingpandq, 0 1 6 7 8 settheidofpIsroottotheidofqIsroot. 9 5 q 0 1 2 3 4 5 6 7 8 9 id[] 0 1 9 4 9 6 6 7 8 6 2 4 p 3 onlyonevaluechanges 68 Demo 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 4 5 6 7 8 9 69 Demo union(4,3) 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 4 5 6 7 8 9 70 Demo union(4,3) 0 1 2 3 5 6 7 8 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 3 5 6 7 8 9 71 Demo union(3,8) 0 1 2 3 5 6 7 8 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 3 5 6 7 8 9 72 Demo union(3,8) 0 1 2 5 6 7 8"
  },
  {
    "text": "3 5 6 7 8 9 71 Demo union(3,8) 0 1 2 3 5 6 7 8 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 3 3 5 6 7 8 9 72 Demo union(3,8) 0 1 2 5 6 7 8 9 3 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 3 5 6 7 8 9 73 Demo union(6,5) 0 1 2 5 6 7 8 9 3 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 3 5 6 7 8 9 74 Demo union(6,5) 0 1 2 5 7 8 9 6 3 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 3 5 5 7 8 9 75 Demo union(9,4) 0 1 2 5 7 8 9 6 3 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 3 5 5 7 8 9 76 Demo union(9,4) 0 1 2 5 7 8 6 3 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 3 5 5 7 8 8 77 Demo union(2,1) 0 1 2 5 7 8 6 3 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 2 8 3 5 5 7 8 8 78 Demo union(2,1) 0 1 5 7 8 2 6 3 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 5 5 7 8 8 79 Demo ✔ connected(8,9) 0 1 5 7 8 2 6 3 9 4 0 1 2 3 4 5 6 7"
  },
  {
    "text": "7 8 2 6 3 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 5 5 7 8 8 79 Demo ✔ connected(8,9) 0 1 5 7 8 2 6 3 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 5 5 7 8 8 80 Demo x connected(5,4) 0 1 5 7 8 2 6 3 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 5 5 7 8 8 81 Demo union(5,0) 0 1 5 7 8 2 6 3 9 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 5 5 7 8 8 82 Demo union(5,0) 0 1 7 8 5 2 3 9 6 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 0 5 7 8 8 83 Demo union(7,2) 0 1 7 8 5 2 3 9 6 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 0 5 7 8 8 84 Demo union(7,2) 0 1 8 5 2 7 3 9 6 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 0 5 1 8 8 85 Demo union(6,1) 0 1 8 5 2 7 3 9 6 4 0 1 2 3 4 5 6 7 8 9 id[] 0 1 1 8 3 0 5 1 8 8 86 Demo union(6,1) 1 8 0 2 7 3 9 5 4 6 0 1 2 3 4 5 6 7 8 9 id[] 1 1 1 8 3 0 5 1"
  },
  {
    "text": "3 4 5 6 7 8 9 id[] 0 1 1 8 3 0 5 1 8 8 86 Demo union(6,1) 1 8 0 2 7 3 9 5 4 6 0 1 2 3 4 5 6 7 8 9 id[] 1 1 1 8 3 0 5 1 8 8 87 Demo union(7,3) 1 8 0 2 7 3 9 5 4 6 0 1 2 3 4 5 6 7 8 9 id[] 1 1 1 8 3 0 5 1 8 8 88 Demo union(7,3) 8 1 3 9 0 2 7 4 5 6 0 1 2 3 4 5 6 7 8 9 id[] 1 8 1 8 3 0 5 1 8 8 89 Demo Finished! 8 1 3 9 0 2 7 4 5 6 0 1 2 3 4 5 6 7 8 9 id[] 1 8 1 8 3 0 5 1 8 8 90 Cost Analysis Costmodel. Numberofarrayaccesses(forreadorwrite). algorithm initialize union find connected quick-find. N N 1 1 quick-union N N† N N worstcase †includescostoffindingroots Quick-finddefect. Uniontooexpensive(Narrayaccesses). Treesareflat,buttooexpensivetokeepthemflat. Quick-uniondefect. Treescangettall. Find/connectedtooexpensive(couldbeNarrayaccesses). 91 Further Improvement Weightedquick-union Modifyquick-uniontoavoidtalltrees. Keeptrackofsizeofeachtree(numberofobjects). Balancebylinkingrootofsmallertreetorootoflargertree. 92 Further Improvement Weightedquick-union Modifyquick-uniontoavoidtalltrees. Keeptrackofsizeofeachtree(numberofobjects). Balancebylinkingrootofsmallertreetorootoflargertree. q p smaller p q q q p p quick-union smaller larger mightputthe larger largertreelower weighted alwayschoosesthe betteralternative larger smaller smaller larger 93 Further Improvement quick-union Weightedquick-union 8 6 1 3 9 4 0 2 5 0 2 7 4 3 8 9 1 7 5 6 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 1 8 1 8 3 0 5 1 8 8 id[] 6 2 6 4 6 6 6 2 4 4 94 Further Improvement quick-union averagedistancetoroot:5.11 averagedistancetoroot:5.11 weighted averagedistancetoroot:1.52 averagedistancetoroot:1.52 Quick-unionandweightedquick-union(100sites,88union()operations) 100sites,88unionoperations. 95 Further Improvement Runningtime."
  },
  {
    "text": "7 8 9 0 1 2 3 4 5 6 7 8 9 id[] 1 8 1 8 3 0 5 1 8 8 id[] 6 2 6 4 6 6 6 2 4 4 94 Further Improvement quick-union averagedistancetoroot:5.11 averagedistancetoroot:5.11 weighted averagedistancetoroot:1.52 averagedistancetoroot:1.52 Quick-unionandweightedquick-union(100sites,88union()operations) 100sites,88unionoperations. 95 Further Improvement Runningtime. Find: takestimeproportionaltodepthofp. Union: takesconstanttime,givenroots. Proposition. DepthofanynodexisatmostlgN. algorithm initialize union find connected quick-find N N 1 1 quick-union N N† N N weightedQU N lgN† lgN lgN †includescostoffindingroots Q. Stopatguaranteedacceptableperformance? A. No,easytoimprovefurther,usingpathcompression-notdiscussedhere1. 96 Summary Summary Keypoint, WeightedquicklunionfandMorpathcompression3makesit possibletosolveproblemsthatcouldnototherwisebeaddressed, algorithm worstlcasetime quicklfind MN quicklunion MN weightedQU NSMlogN QUSpathcompression NSMlogN weightedQUSpathcompression NSMlg6N orderofgrowthforMunionlfindoperationsonasetofNobjects, Ex, [+N9unionsandfindswith+N9objects] WQUPCreducestimefrom*Nyearsto6seconds, SupercomputerwonCthelpmuch'goodalgorithmenablessolution, 97 Summary Stepstodevelopingausablealgorithm. Modeltheproblem. Findanalgorithmtosolveit. Fastenough?Fitsinmemory? Ifnot,figureoutwhynot. Findawaytoaddresstheproblem. Iterateuntilsatisfied. 98"
  },
  {
    "text": "THE SLEREXE COMPANY LIMITED SAPORS LANE - BOOLE - DORSET - BH 25 8ER TELEPHONE BOOLE (945 13) 51617 - TELEX 123456 Our Ref. 350/PJC/EAC 18th January, 1972. Dr. P.N. Cundall, Mining Surveys Ltd., Holroyd Road, Reading, Berks. Dear Pete, Permit me to introduce you to the facility of facsimile transmission. In facsimile a photocell is caused to perform a raster scan over the subject copy. The variations of print density on the document cause the photocell to generate an analogous electrical video signal. This signal is used to modulate a carrier, which is transmitted to a remote destination over a radio or cable communications link. At the remote terminal, demodulation reconstructs the video signal, which is used to modulate the density of print produced by a printing device. This device is scanning in a raster scan synchronised with that at the transmitting terminal. As a result, a facsimile copy of the subject document is produced. Probably you have uses for this facility in your organisation. Yours sincerely, ThA. P.J. CROSS Group Leader - Facsimile Research Registered in England: No. 2088 No. 1 Registered Office: 6O Vicara Lane, Ilford. Eseex,"
  }
]